Documents/Requests/Soap_GetSmartCardType- API Mod_09_05_2022_09_44_34_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/card/VFDEGetSmartCardType" xmlns:vfd1="http://amdocs/vfde/card/VFDEGetSmartCardTypeInput">
  <soapenv:Header />
  <soapenv:Body>
    <vfd:GetSmartCardTypeRequest>
      <vfd1:ROOT>
        <Event>
          <Type>GetSmartCardType</Type>
          <ID>592151c2067f3</ID>
          <!--Optional:-->
          <CallerID>Omnius</CallerID>
          <!--Optional:-->
          <CorrelationID>k10j95sg237odc317qcbbf199ske2tik</CorrelationID>
          <!--Optional:-->
          <!--Optional:-->
          <!--Optional:-->
          <!--Optional:-->
          <MessageCreationTimestamp>2017-05-21T08:37:22</MessageCreationTimestamp>
          <!--Optional:-->
          <FrontendUserId>1</FrontendUserId>
          <!--Optional:-->
          <DealerCode>34401773</DealerCode>
          <!--Optional:-->
          <SalesChannel>retail</SalesChannel>
          <!--Optional:-->
          <!--Optional:-->
        </Event>
        <DATA>
          <SmartCardSerialNumber>051547475969</SmartCardSerialNumber>
        </DATA>
      </vfd1:ROOT>
    </vfd:GetSmartCardTypeRequest>
  </soapenv:Body>
</soapenv:Envelope>